{"Creativity, Innovation and Knowledge Management (EXECUTIVE MBA)": "### Présentation Générale\nLe cours ST602E4, intitulé \"Gestion de la Créativité, de l'Innovation et de la Gestion des Connaissances\", fait partie du programme Executive MBA à Rennes School of Business pour l'année académique 2024-2025. Dirigé par Hamid Mazloomi, ce module s'étend sur 25 heures de contact réparties sur 2,5 jours et attribue 3 crédits ECTS. Les étudiants doivent avoir une bonne compréhension générale du management et des stratégies d'entreprise avant d'y participer.\n\n### Objectifs d'Apprentissage\nLes objectifs principaux du cours incluent :\n\nComprendre et intégrer les fondements du management et les fonctions commerciales.\nDévelopper une perspective stratégique.\nAméliorer les compétences en leadership, communication et travail en équipe.\nPromouvoir une gestion responsable intégrant diversité et mondialisation.\nEncourager l'innovation, l'entrepreneuriat et la créativité dans un cadre pratique.\nApporter une valeur ajoutée à la communauté professionnelle.\n\n### Résultats d'Apprentissage Attendus\nÀ l'issue du cours, les étudiants devraient être capables :\n\nDe comprendre les concepts théoriques clés liés à la gestion des connaissances et à l'innovation.\nD'évaluer les stratégies d'innovation sous un angle basé sur les connaissances.\nDe développer des cadres cohérents pour créer, transférer et exploiter le savoir critique au sein des entreprises.\nD'interagir efficacement avec les décideurs stratégiques impliqués dans ces activités.\n\n### Thèmes Abordés dans le Cours\nLe contenu couvre divers sujets tels que :\n\nLa nature de l'économie des données et son impact sur la création de connaissances.\nL'utilisation stratégique de la science des données pour améliorer le processus décisionnel dans les entreprises modernes.\nLes implications organisationnelles liées à la gestion des travailleurs du savoir.\nL'intégration des technologies telles que le data mining, l'intelligence artificielle (IA) et le machine learning pour soutenir la création de valeur stratégique basée sur l'innovation.\n", "Team Development & Management": "### Course objectives\n…evidence-based frameworks and best practices of team\nmanagement.\nLearn how to analyze and identify team problems and suggest\nappropriate solutions.\nDevelop initial pre-practice intuition regarding the factors of highperforming teams.\n\n### Perspective: Line manager\n• Line manager is the person in an organization who is managing front-line workforce\n• Project management in IT company (manages developers, testers etc)\n• Call center manger (manages operators)\n• Sales manager (manages salesforce)\n• Head of department in academic context (manages professors)\n• Line managers typically do the following:\n• Manage small or medim-size teams\n• Have limited possibilities for delegation\n• Depend on upper-level management and organizational strategy\n• Perform a vide range of functions: goal setting, coordination, conflict management etc\n\n### Course outline\n• Introduction to the course & teams\n• Project teams: classical and Agile\n• Goal setting and performance assessment\n• Communication in teams\n• Motivation and incentives\n• Learning, training and development\n• Creativity in teams\n• Trust and cohesion\n• Diagnosing and fixing team problems\n• Managing teams of teams & Capstone activity\n"}